Revit 2027 API
ViewActivatedEventArgs.PreviousActiveView Property
 The previously active view.
Namespace: Autodesk.Revit.UI.Events
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public View PreviousActiveView { get; }
Public ReadOnly Property PreviousActiveView As View
	Get
public:
property View^ PreviousActiveView {
	View^ get ();
}
member PreviousActiveView : View with get
Property Value
View
Remarks
 May be null if there was no previously active view.
See Also
Reference
ViewActivatedEventArgs Class
Autodesk.Revit.UI.Events Namespace